# 자기소개 프로그램
# 이름, 나이, 성별, 키
공간1 = '김순표'
공간2 = '25'
공간3 = '남자'
공간4 = '150.0'


print('안녕하세요 제 이름은 ',공간1,'입니다.')
print('나이는' ,공간2,'살이고 성별은 ',공간3,'입니다.')
print('키는' ,공간4, '입니다.')

이름 = '홍길동'
나이 = 33
성별 = '남성'
키 = 177.7

print('안녕하세요 제이름은',이름,'입니다.')
print('나이는' ,나이,'살이고 성별은',성별,'입니다.')
print('키는',키, 'cm 입니다.')


# 127-4
print(127-4)            #123
print('127-4')          #127-4

# 자료형 : 개발자의 의도를 명확히 해주고 오류를 발견해줌
# '' : 문자열 str
# 314 : 정수 int
# 3.14: 실수 float
print(int(3.14))
print(float(3))
print(str(314))